{
  "news": [
    {
      "id": 1,
      "title": "Chrome будет блокировать скачивание опасных файлов",
      "date": "11.02.2020 13:37",
      "heading": "programming",
      "massmedia": "The Verge",
      "description": "Google объявила о том, что ее браузер Chrome начнет предупреждать пользователей о скачивании «небезопасных» файлов, а затем будет полностью их блокировать. В апреле будет выпущен Chrome версии 82, который будет прямо сообщать о риске при скачивании exe-программ. В версии 83 такие программы будут блокироваться полностью, а предупреждение будет появляться при скачивании архивов. В версии 84 предупреждение будет демонстрироваться при скачивании pdf- и doc-файлов, а в версии 85 — при скачивании аудио, картинок, текста и видео. Наконец, все небезопасные файлы будут заблокированы в Chrome 86, который планируют выпустить в октябре. Так Google надеется заставить веб-разработчиков полностью мигрировать на защищенный протокол HTTPS. Появятся предупреждения и в мобильных версиях Chrome для Android и iOS — чуть позже. Смартфоны и планшеты лучше защищены от хакерских атак, и у разработчиков будет больше времени для обновления мобильных версий их сайтов.",
      "image": {
        "small": "img/1-1.jpg",
        "large": "img/1-2.jpg"
      }
    },
    {
      "id": 2,
      "title": "Bioware полностью переработает Anthem",
      "date": "11.02.2020 09:51",
      "heading": "games",
      "massmedia": "Slashgear",
      "description": " Около года назад канадская студия Bioware выпустила свою очередную игру под названием Anthem, которая в итоге стала одним из главных разочарований 2019. Разработчики пытались исправить ситуацию небольшими обновлениями, а теперь объявили о том, что заняты полной переделкой большинства аспектов игры. Рассказал об этом глава Bioware Кейси Хадсон. Никаких подробностей пока нет, но ожидается, что Anthem изменится в корне — грядущие нововведения будут «чем-то большим, чем обновление или дополнение». В ближайшие месяцы мы сфокусируемся на долгосрочном редизайне всего игрового опыта, чтобы добавить в геймплей ясные цели, мотивирующие испытания и систему прогресса со значимыми наградами,» пишет Хадсон. В первую очередь, обещает он, авторы Anthem будут работать над игровым процессом. Кроме того, в ближайшее время в Anthem будут проводиться небольшие внутриигровые события — например, к концу февраля начнется празднование годовщины релиза. Скорее всего, переделка игры займет не один месяц. О том, что Bioware занята чем-то подобным, уже сообщало издание Kotaku — еще в ноябре прошлого года.",
      "image": {
        "small": "img/2-1.jpg",
        "large": "img/2-2.jpg"
      }
    },
    {
      "id": 3,
      "title": "Род Фергюссон уйдет из The Coalition и займется Diablo",
      "date": "11.02.2020 13:37",
      "heading": "games",
      "massmedia": "Polygon",
      "description": "Ветеран игровой индустрии Род Фергюссон покинет студию The Coalition, которой он помогал создавать шутер Gears 5. Теперь он перейдет в Blizzard, где займется развитием франчайза Diablo. Об этом Фергюссон объявил в личном Twitter-аккаунте. «Я люблю нашу Gears-семью, фанатов и всех сотрудников The Coalition и Xbox, так что это горьковато-сладкое решение,» сказал продюсер. «Огромное вам спасибо! Работать с вами — это большая честь».Карьера Фергюссона в индустрии видеоигр началась в Microsoft еще в девяностых. В начале двухтысячных он присоединился к Epic Games, где участвовал в создании франчайза Gears of War. В The Coalition, которая занялась Gears после Epic Games, он пришел в 2015. Gears 5 выпустили в конце 2019, и игра стала вполне успешной — как в плане оценок в прессе, так и в плане заработанных денег. Diablo IV Blizzard анонсировала в ноябре прошлого года — на BlizzCon 2019. Пока что даже о примерной дате выхода экшен-RPG компания ничего не сообщает.",
      "image": {
        "small": "img/3-1.jpg",
        "large": "img/3-2.jpg"
      }
    },
    {
      "id": 4,
      "title": "Google научила ИИ распознавать язык жестов",
      "date": "29.01.2020 12:30",
      "heading": "programming",
      "massmedia": "Ubergizmo",
      "description": "Google Translate отлично справляется с большинством популярных языков, но что насчет тех методов коммуникации, которые не используют буквы — например, с языком жестов? Исследователи корпорации сообщают  о том, что научили понимать его и общаться на нем искусственный интеллект. В будущем такой ИИ сможет конвертировать жесты немых людей в синтетический голос — для того, чтобы они могли разговаривать и с теми, кому язык жестов не знаком. Для этого используется камера и специальное ПО, которое отслеживает движение рук и пальцев. Утверждается, что все это работает в реальном времени на обычных смартфонах. Когда-то давно мобильники не имели таких мощных чипсетов, и для интерпретации языка жестов нужно было использовать производительные рабочие станции. К сожалению, пока что технология не идеальна — переводчик не учитывает выражение лица человека, скорость жестикуляции и региональные особенности языка. В будущем Google собирается заниматься развитием алгоритма, улучшая трекинг и увеличивая количество распознаваемых жестов.",
      "image": {
        "small": "img/4-1.jpg",
        "large": "img/4-2.jpg"
      }
    },
    {
      "id": 5,
      "title": "Microsoft выпустила браузер Edge на базе Chromium",
      "date": "16.01.2020 09:16",
      "heading": "programming",
      "massmedia": "GSMArena",
      "description": "Microsoft наконец-то представила  финальную версию своего нового браузера Edge, который базируется на открытом коде Chromium. Последний также является основой Google Chrome. Установить новый браузер можно и на Windows, и на macOS. Edge на Chromium анонсировали еще в декабре 2018  — на доработку и тестирование инженерам Microsoft понадобилось больше года. Все пользователи Windows 10 получат новую версию Edge в рамках системы обновлений ОС на протяжении ближайших месяцев. Автоматическая миграция начнется с небольшого количества «инсайдеров» уже в этом месяце. Edge синхронизирует пароли, закладки и настройки между девайсами, а в качестве главной поисковой системы используется Bing. Есть и специальный режим для старых сайтов, который имитирует Internet Explorer.",
      "image": {
        "small": "img/5-1.jpg",
        "large": "img/5-2.jpg"
      }
    }
  ]
}